---
kind: method
id: M:Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDGNImportLinkAvailable
source: html/0b13c77b-73bf-d9a2-5570-4079de694d84.htm
---
# Autodesk.Revit.DB.OptionalFunctionalityUtils.IsDGNImportLinkAvailable Method

Checks whether the DGN Import/Link functionality is available in the installed Revit.

## Syntax (C#)
```csharp
public static bool IsDGNImportLinkAvailable()
```

## Returns
True if the DGN Import/Link functionality is available in the installed Revit.

## Remarks
DGN Import/Link is optional functionality that does not have to be part of the Revit installation.